*** 具体的な OrganismFactory

#+BEGIN_SRC ruby :tangle abstract_factory/organism_factories/frog_and_algae.rb :mkdirp yes
require 'abstract_factory/organism_factory'
require 'abstract_factory/animals/frog.rb'
require 'abstract_factory/plants/algae.rb'

class FrogAndAlgaeFactory < OrganismFactory
  private

  def new_animal(name)
    Frog.new(name)
  end

  def new_plant(name)
    Algae.new(name)
  end
end
#+END_SRC

#+BEGIN_SRC ruby :tangle abstract_factory/organism_factories/duck_and_waterlily.rb :mkdirp yes
require 'abstract_factory/organism_factory'
require 'abstract_factory/animals/duck.rb'
require 'abstract_factory/plants/waterlily.rb'

class DuckAndWaterLilyFactory < OrganismFactory
  private

  def new_animal(name)
    Duck.new(name)
  end

  def new_plant(name)
    WaterLily.new(name)
  end
end

#+END_SRC


#+BEGIN_SRC ruby :tangle abstract_factory/do_frog_and_algae_factory.rb :results output
$: << "."

require 'abstract_factory/organism_factory'
require 'abstract_factory/organism_factories/frog_and_algae'
# require 'abstract_factory/animals/frog'
# require 'abstract_factory/plants/algae'


factory = FrogAndAlgaeFactory.new(4,1)
animals = factory.get_animals
animals.each do |animal| 
  animal.eat
end

plants = factory.get_plants
plants.each do |plant|
  plant.grow
end


#+END_SRC

#+RESULTS:
#+begin_example
frog 動物0 は食事中です.
Animalは食べるものですから。
frog 動物1 は食事中です.
Animalは食べるものですから。
frog 動物2 は食事中です.
Animalは食べるものですから。
frog 動物3 は食事中です.
Animalは食べるものですから。
藻 植物0 は成長中です.
Plant は成長するものですから。
#+end_example


#+BEGIN_SRC ruby :tangle abstract_factory/do_duck_and_waterlily_factory.rb :results output
$: << "."

require 'abstract_factory/organism_factory'
require 'abstract_factory/organism_factories/duck_and_waterlily'
# require 'abstract_factory/animals/duck'
# require 'abstract_factory/plants/waterlily'

factory = DuckAndWaterLilyFactory.new(4,1)
animals = factory.get_animals
animals.each do |animal| 
  animal.eat
end

plants = factory.get_plants
plants.each do |plant|
  plant.grow
end


#+END_SRC

#+RESULTS:
: duck 動物0 は食事中です.
: Animalは食べるものですから。
: duck 動物1 は食事中です.
: Animalは食べるものですから。
: duck 動物2 は食事中です.
: Animalは食べるものですから。
: duck 動物3 は食事中です.
: Animalは食べるものですから。
: 睡蓮 植物0 は成長中です.

